# **Pandas 03 - Konversi Tipe Data String ke Numerik pada Kolom Data Frame**

### Import Modules

In [10]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.0
1.24.2

### Persiapan Data Frame

In [11]:
# Membuat data dictionary untuk pembuatan data frame dengan dua kolom, 'col1' dan 'col2'
data = {'col1':['1', '2', '3', 'teks'],
        'col2':['1', '2', '3', '4']} 

# Membuat data frame dari data dictionary yang telah dibuat
df = pd.DataFrame(data)

# Menampilkan data frame yang telah dibuat
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [12]:
# Menggunakan atribut dtypes pada data frame untuk menampilkan tipe data dari setiap kolom
df.dtypes

col1    object
col2    object
dtype: object

### Konversi tipe data dengan fungsi astype()

In [13]:
# Menggunakan metode astype untuk mengubah tipe data kolom 'col2' menjadi integer
df_x = df.astype({'col2':'int'})

# Menampilkan data frame yang telah diubah tipe datanya
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [14]:
# Menggunakan atribut dtypes pada data frame df_x untuk menampilkan tipe data dari setiap kolom
df_x.dtypes

col1    object
col2     int32
dtype: object

### Konversi tipe data numerik dengan fungsi to_numeric()

In [15]:
# Mengubah seluruh nilai dalam data frame menjadi numerik
# Mengubah nilai non-numerik menjadi Not A Number
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4